# KeyBasedTreeFileFailures Properties

---
The BuiltInFailuresKeyBasedTreeFileFailures type exposes the following members.
| Name| Description
---|---|---
| CannotOpenFileForRead|  Cannot open file [FileName].
| CannotUnderstandAtLine|  Cannot understand [EntryType] line '[Number]'
Top
#### Reference
BuiltInFailuresKeyBasedTreeFileFailures Class
Autodesk.Revit.DB Namespace